"""
A. A+B

Это ваша первая задача. В ней вам придётся прочитать два числа и сложить их. 
Результат необходимо вывести на стандартный поток вывода или в файл, указанный 
в условии задачи.
Рекомендуем воспользоваться заготовками кода для данной задачи, лежащими в 
репозитории курса.

Формат ввода
В первой строке задано первое число, во второй – второе. Оба числа лежат в 
диапазоне от -10^9 до 10^9.

Формат вывода
Выведите единственное число – результат сложения двух чисел.

Пример 1
Ввод	Вывод
12
90       102

Пример 2
Ввод	Вывод
200
-200     0

Пример 3
Ввод	        Вывод
1000000000
1000000000     2000000000
"""

n1 = int(input())
n2 = int(input())

print(n1 + n2)